src/cf/Catalogs/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодарочныеСертификаты</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыПодарочныхСертификатов</xr:Item>
			</Owners>
		</Properties>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСтатусовПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПодарочныеСертификаты</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выпущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодарочныеСертификаты/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоДействующиеВиды") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец.Действует", Истина, 
				ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
			
	Если Параметры.Свойство("ТолькоНеАктивированные") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПодарочныеСертификаты.Ссылка КАК ПодарочныйСертификат
			|ИЗ
			|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовПодарочныхСертификатов КАК ИсторияСтатусовПодарочныхСертификатов
			|		ПО (ИсторияСтатусовПодарочныхСертификатов.ПодарочныйСертификат = ПодарочныеСертификаты.Ссылка)
			|		И ИсторияСтатусовПодарочныхСертификатов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Выпущен)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовПодарочныхСертификатов КАК ИсторияСтатусовПодарочныхСертификатов2
			|		ПО (ИсторияСтатусовПодарочныхСертификатов2.ПодарочныйСертификат = ПодарочныеСертификаты.Ссылка)
			|		И ИсторияСтатусовПодарочныхСертификатов2.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Активирован), 
			|														   ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ЧастичноИспользован), 
			|														   ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПолностьюИспользован), 
			|														   ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Возвращен), 
			|														   ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Аннулирован))
			|ГДЕ
			|	ИсторияСтатусовПодарочныхСертификатов2.Период ЕСТЬ NULL";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НеАктивированныеСертификаты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПодарочныйСертификат");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", НеАктивированныеСертификаты, 
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоАктивированные") И Параметры.Свойство("Дата") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.ПодарочныйСертификат КАК ПодарочныйСертификат
			|ПОМЕСТИТЬ ВТ_ДействующиеСертификаты
			|ИЗ
			|	РегистрСведений.ИсторияСтатусовПодарочныхСертификатов.СрезПоследних(&Дата, ) КАК ИсторияСтатусовПодарочныхСертификатовСрезПоследних
			|ГДЕ
			|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Активирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ЧастичноИспользован))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИсторияСтатусовПодарочныхСертификатов.ПодарочныйСертификат КАК ПодарочныйСертификат,
			|	МАКСИМУМ(ИсторияСтатусовПодарочныхСертификатов.ДействуетДо) КАК ДействуетДо
			|ПОМЕСТИТЬ ВТ_СрокиДействияПодарочныхСертификатов
			|ИЗ
			|	РегистрСведений.ИсторияСтатусовПодарочныхСертификатов КАК ИсторияСтатусовПодарочныхСертификатов
			|
			|СГРУППИРОВАТЬ ПО
			|	ИсторияСтатусовПодарочныхСертификатов.ПодарочныйСертификат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПодарочныеСертификатыОстатки.ПодарочныйСертификат КАК ПодарочныйСертификат,
			|	ПодарочныеСертификатыОстатки.СуммаОстаток КАК ОстатокСтоимости
			|ПОМЕСТИТЬ ВТ_ОстаткиСтоимости
			|ИЗ
			|	РегистрНакопления.ПодарочныеСертификаты.Остатки(&Дата, ) КАК ПодарочныеСертификатыОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ПодарочныйСертификат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДействующиеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
			|	ВТ_ОстаткиСтоимости.ОстатокСтоимости КАК ОстатокСтоимости
			|ИЗ
			|	ВТ_ДействующиеСертификаты КАК ВТ_ДействующиеСертификаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СрокиДействияПодарочныхСертификатов КАК ВТ_СрокиДействияПодарочныхСертификатов
			|		ПО ВТ_ДействующиеСертификаты.ПодарочныйСертификат = ВТ_СрокиДействияПодарочныхСертификатов.ПодарочныйСертификат
			|			И (ВТ_СрокиДействияПодарочныхСертификатов.ДействуетДо >= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ))
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиСтоимости КАК ВТ_ОстаткиСтоимости
			|		ПО ВТ_ДействующиеСертификаты.ПодарочныйСертификат = ВТ_ОстаткиСтоимости.ПодарочныйСертификат";
		
		Запрос.УстановитьПараметр("Дата", Параметры.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		АктивированныеСертификаты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПодарочныйСертификат");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", АктивированныеСертификаты, 
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("ВидПодарочныхСертификатов") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.ВидПодарочныхСертификатов, 
				ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("Валюта") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец.Валюта", Параметры.Валюта, 
				ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоВозвратные") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец.Возвратный", Истина, 
				ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
КонецПроцедуры
